function onedaySaving(s, times) {
   
}

// 문제설명
// 처음으로 저축한 날짜부터 마지막으로 저축한 날짜까지 매일 1회 이상 저축을 했다면, '1일 1저축'에 성공했다고 판단합니다.
// 예를 들어, 
// 첫 번째 저축을 '2021년 4월 12일 오후 4시 8분 35초'에 하고,
// 두 번째 저축을 '1일 6시간 30분'뒤인, '2021년 4월 13일 오후 10시 38분 35초'에 하고,
// 마지막 저축을 '1일 4시간 12분'뒤인, '2021년 4월 15일 오전 2시 50분 35초'에 했다면,
  // - 4월 14일에는 저축을 하지 않았기 때문에 '1일 1저축'은 실패입니다.
  // - 첫 저축 날짜는 4월 12일이고, 마지막 저축 날짜는 4월 15일이므로, 저축 기간은 4일입니다.
    // ㄴ 저축 기간은 첫 저축 날짜부터 마지막 저축 날짜까지 포함하여 그 사이 모든 날짜를 저축 유무와 상관없이 한 번씩 센 기간입니다.
// 만약,
// 첫 번째 저축을 '2021년 4월 12일 오후 4시 8분 35초'에 하고,
// 두 번째 저축을 '1일 6시간 30분'뒤인 '2021년 4월 13일 오후 10시 38분 35초'에 하고,
// 마지막 저축을 '0일 1시간 12분 뒤인, '2021년 4월 13일 오후 11시 50분 35초'에 했다면,
  // - 4월 12일부터 4월 13일가지 매일 1회 이상 저축을 했기 때문에 '1일 1저축'은 성공입니다.
  // - 첫 저축 날짜는 4월 12일이고, 마지막 저축 날자는 4월 13일이므로, 저축 기간은 2일입니다.
// 첫 저축을 시작한 시각인 문자열 's', 다음 저축까지 걸린 기간을 담은 문자열 배열 'times'을 매개변수로 주어질 때,
// '1일 1저축' 성공 여부와 저축 기간을 담은 배열을 return 하도록 onedaySaving 함수를 완성해주세요.


// 제한사항
  // - 문제를 간단하게 하기 위해, 윤년은 없으며 모든 달은 30일이 마지막 날이라고 가정합니다. 따라서, 1년은 360일입니다.
  // - return 값 형식
    // ㄴ 길이 2인 정수형 배열을 return 합니다.
    // ㄴ ['1일 1저축'의 성공 여부, 저축한 기간]을 return 합니다.
    // ㄴ 첫 번째 원소로 '1일 1저축'에 성공했다면 1을, 성공하지 못했다면 0을 담습니다.
    // ㄴ 두 번째 원소로 저축 기간(일)을 담습니다.
  // - 's'는 'YYYY:MM:DD:HH:mm:SS'형태인 문자열입니다.
    // ㄴ 'YYYY'는 연도는 뜻합니다. 1년은 '0001:MM:DD:HH:mm:SS'형태로 주어집니다.
      // ㄴ 1 <= YYYY <= 9999
    // ㄴ 'MM'은 월을 뜻합니다. 1월은 'YYYY:01:DD:HH:mm:SS'형태로 주어집니다.
      // ㄴ 1 <= MM <= 12
    // ㄴ 'DD'는 일을 뜻합니다. 1일은 'YYYY:MM:01:HH:mm:SS'형태로 주어집니다.
      // ㄴ 1 <= DD <= 30
    // ㄴ 'HH'는 시를 뜻합니다. 오전 1시는 'YYYY:MM:DD:01:mm:SS'형태로 주어집니다.
      // ㄴ 0 <= HH <= 23
    // ㄴ 'mm'은 분을 뜻합니다. 1분은 'YYYY:MM:DD:HH:01:SS'형태로 주어집니다.
      // ㄴ 0 <= mm <= 59
    // ㄴ 'SS'는 초를 뜻합니다. 1초는 'YYYY:MM:DD:HH:mm:01'형태로 주어집니다.
      // ㄴ 0 <= SS <= 59
    // 예를 들어, 1년 1월 1일 오전 1시 1분 1초는 '0001:01:01:01:01:01'형태로 주어집니다.
    // 또한, 2021년 11월 30일 오후 10시 4분 24초는 '2021:11:30:22:04:24'형태로 주어집니다.
  // - 0 <= times의 길이 <= 1000
  // times의 원소는 'DD:HH:mm:SS'의 형태로 주어집니다.
    // ㄴ 'DD'는 일을 뜻합니다. 1일은 '01:HH:mm:SS' 형태로 주어집니다.
      // ㄴ 0 <= DD <= 99
    // ㄴ 'HH'는 시를 뜻합니다. 1시간은 'DD:01:mm:SS'형태로 주어집니다.
      // ㄴ 0 <= HH <= 23
    // ㄴ 'mm'은 분을 뜻합니다. 1분은 'DD:HH:01:SS'형태로 주어집니다.
      // ㄴ 0 <= mm <= 59
    // ㄴ 'SS'는 초를 뜻합니다. 1초는 'DD:HH:mm:01'형태로 주어집니다.
      // ㄴ 0 <= SS <= 59
    // 예를 들어, 0일 2시간 5분 18초는 '00:02:05:18'형태로 주어집니다.
  // 마지막 저축 시각이 9999년을 초과하는 입력은 주어지지 않습니다.

// 입출력 예
// 예시1)
  //       | s                     | times                                         | result
  // 예시1) | '2021:04:12:16:08:35' | ['01:06:30:00', '01:04:12:00']                | [0,4]
  // 예시2) | '2021:04:12:16:08:35' | ['01:06:30:00', '00:01:12:00']                | [1,2]
  // 예시3) | '2021:04:12:16:10:42' | ['01:06:30:00']                               | [1,2]
  // 예시4) | '2021:04:12:16:08:35' | ['01:06:30:00', '01:01:12:00', '00:00:09:25'] | [1,4]

// 입출력 예시 설명
// 예시1) 문제의 첫 번째 예시와 같습니다. '1일 1저축'을 실패했습니다. 저축 기간은 4월 12일 ~ 4월 15일, 총 4일입니다. 따라서 정답은 [0,4]입니다.
// 예시2) 문제의 두 번째 예시와 같습니다. '1일 1저축'을 성공했습니다. 저축 기간은 4월 12일 ~ 4월 13일, 총 2일입니다. 따라서 정답은 [1,2]입니다.
// 예시3) 
  // - 첫 번째 저축은 '2021년 4월 12일 오후 4시 10분 42초'에 합니다.
  // - 두 번째 저축은 '1일 6시간 30분'뒤인, 2021년 4월 13일 오후 10시 40분 42초'에 합니다.
  // 4월 12일과 4월 13일 모두 저축을 했기 때문에 '1일 1저축'에 성공했습니다. 저축기간은 4월 12일 ~ 4월 13일, 총 2일입니다.
  // 따라서 정답은 [1,2]입니다.
// 예시4)
  // - 첫 번째 저축은 '2021년 4월 12일 오후 4시 8분 35초'에 합니다.
  // - 두 번째 저축은 '1일 6시간 30분'뒤인, '2021년 4월 13일 오후 10시 38분 35초'에 합니다.
  // - 세 번재 저축은 '1일 1시간 12분'뒤인, '2021년 4월 14일 오후 11시 50분 35초'에 합니다.
  // - 네 번째 저축은 '0일 0시간 9분 25초'뒤인, '2021년 4월 15일 오전 0시 0분 0초'에 합니다.
  // 4월 12일부터 4월 15일까지 모두 저축을 했기 때문에 '1일 1저축'에 성공했습니다. 저축기간은 4월 12일 ~ 4월 15일, 총 4일입니다.
  // 따라서 정답은 [1,4]입니다.
